InformationRegisters/упРасстоянияМеждуЗонами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упРасстоянияМеждуЗонами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НачальнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонечнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упРасстоянияМеждуЗонами/Ext/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбратныйПуть") Тогда 
		Для Каждого текЗапись Из ЭтотОбъект Цикл 
			Если текЗапись.НачальнаяЗона = текЗапись.КонечнаяЗона Тогда 
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.упРасстоянияМеждуЗонами.СоздатьНаборЗаписей();
			НаборЗаписей.ДополнительныеСвойства.Вставить("ОбратныйПуть");
			НаборЗаписей.Отбор.НачальнаяЗона.Установить(текЗапись.КонечнаяЗона);
			НаборЗаписей.Отбор.КонечнаяЗона.Установить(текЗапись.НачальнаяЗона);
			
			ОбратныйПуть = НаборЗаписей.Добавить();
			ОбратныйПуть.НачальнаяЗона = текЗапись.КонечнаяЗона;
			ОбратныйПуть.КонечнаяЗона  = текЗапись.НачальнаяЗона;
			ОбратныйПуть.Расстояние    = текЗапись.Расстояние;
			ОбратныйПуть.Время         = текЗапись.Время;
			
			НаборЗаписей.Записать();
		КонецЦикла;	                
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
